[
	{
		"id": 1,
		"title": "Task Manager",
		"description": "A task management application designed to help teams organize and prioritize their daily tasks. Built with React and Firebase for real-time updates.",
		"image": "/src/assets/images/project1.jpg",
		"demoLink": "#",
		"codeLink": "#"
	},
	{
		"id": 2,
		"title": "Personal Blog",
		"description": "A personal blog platform that allows users to write and share articles. Built with Node.js and MongoDB, it features markdown support and user authentication.",
		"image": "/src/assets/images/project2.jpg",
		"demoLink": "#",
		"codeLink": "#"
	},
	{
		"id": 3,
		"title": "E-Commerce Website",
		"description": "An e-commerce site that offers product browsing, cart management, and a secure checkout process. Built using React and Stripe for payment integration.",
		"image": "/src/assets/images/project3.jpg",
		"demoLink": "#",
		"codeLink": "#"
	},
	{
		"id": 4,
		"title": "Chat Application",
		"description": "A real-time messaging app using WebSockets and Node.js, allowing instant communication between users with features like private chats and group rooms.",
		"image": "/src/assets/images/project4.jpg",
		"demoLink": "#",
		"codeLink": "#"
	},
	{
		"id": 5,
		"title": "Portfolio Website",
		"description": "A personal portfolio website to showcase skills, projects, and experience. Built using HTML, CSS, and JavaScript with a mobile-first design approach.",
		"image": "/src/assets/images/project5.jpg",
		"demoLink": "#",
		"codeLink": "#"
	},
	{
		"id": 6,
		"title": "Fitness Tracker",
		"description": "A mobile app that tracks daily activities, workouts, and nutrition. Built with React Native, it integrates with third-party APIs for tracking health data.",
		"image": "/src/assets/images/project6.jpg",
		"demoLink": "#",
		"codeLink": "#"
	},
	{
		"id": 7,
		"title": "Budget Planner",
		"description": "A budgeting tool to help users track income and expenses. Built with Vue.js, it offers interactive charts and financial insights.",
		"image": "/src/assets/images/project7.jpg",
		"demoLink": "#",
		"codeLink": "#"
	},
	{
		"id": 8,
		"title": "Recipe Finder",
		"description": "A recipe search engine that allows users to find recipes based on ingredients. Built with React and external APIs for pulling recipe data.",
		"image": "/src/assets/images/project8.jpg",
		"demoLink": "#",
		"codeLink": "#"
	},
	{
		"id": 9,
		"title": "Weather App",
		"description": "A weather forecasting app that provides real-time weather information based on location. Built with JavaScript and the OpenWeather API.",
		"image": "/src/assets/images/project9.jpg",
		"demoLink": "#",
		"codeLink": "#"
	},
	{
		"id": 10,
		"title": "Online Learning Platform",
		"description": "A platform for online courses with features like video streaming, quizzes, and progress tracking. Built with Django and React for a seamless user experience.",
		"image": "/src/assets/images/project10.jpg",
		"demoLink": "#",
		"codeLink": "#"
	}
]
